# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Henry Alberto\Documents\GitHub\Modular_Robot\Robot_Test_Program_PSOC_5_LP\Blink.cydsn\Blink.cyprj
# Date: Tue, 03 Jan 2017 01:06:38 GMT
#set_units -time ns
create_clock -name {SENSORES_intClock(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {SENSORES_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 49 97} [list]


# Component constraints for C:\Users\Henry Alberto\Documents\GitHub\Modular_Robot\Robot_Test_Program_PSOC_5_LP\Blink.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Henry Alberto\Documents\GitHub\Modular_Robot\Robot_Test_Program_PSOC_5_LP\Blink.cydsn\Blink.cyprj
# Date: Tue, 03 Jan 2017 01:06:31 GMT
